# Data Merging

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

C:\Users\MC\AppData\Local\Temp\ipykernel_13732\1020607637.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
data1={'id':[1,2,3],
    'name':["Husnain","Bilal","Naveed"],
    'city':['sgd','lhr','isb']}
df1=pd.DataFrame(data1)
df1.head()

   id     name city
0   1  Husnain  sgd
1   2    Bilal  lhr
2   3   Naveed  isb

In [9]:
data2={'id':[1,2,3],
    'job':["clerk","internee","SE"],
    'salary':[15000,100000,1000000]}
df2=pd.DataFrame(data2)
df2.head()

   id       job   salary
0   1     clerk    15000
1   2  internee   100000
2   3        SE  1000000

In [10]:
df=pd.merge(df1,df2,on='id',how='inner')

In [11]:
df.head()

   id     name city       job   salary
0   1  Husnain  sgd     clerk    15000
1   2    Bilal  lhr  internee   100000
2   3   Naveed  isb        SE  1000000

-----------------

# Data Concatenation

In [15]:
data1={'name':["Husnain","Usman","Ali"],'age':[5,12,14]}
data2={'name':["Arslan","Noman","Hassan"],'age':[71,110,135]}
data3={'city':["sargodha","sukkur","peshawar"],'province':["Punjab",'sindh','KPK']}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.DataFrame(data3)
# concatenation by row
concatenation_rows=pd.concat([df1,df2],axis=0)
print("Concatenation by rows")
print(concatenation_rows)
concatenation_col=pd.concat([df1,df2],axis=1)
print("Concatenation by rows")
print(concatenation_col)

Concatenation by rows
      name  age
0  Husnain    5
1    Usman   12
2      Ali   14
0   Arslan   71
1    Noman  110
2   Hassan  135
Concatenation by rows
      name  age    name  age
0  Husnain    5  Arslan   71
1    Usman   12   Noman  110
2      Ali   14  Hassan  135